/* 引用头文件 ------------------------------------------------------------------*/  
#include "./ChipID/bsp_chipid.h"    //引用bsp_chipid配置头文件

/* 定义全局变量 ------------------------------------------------------------------*/
uint32_t ChipUniqueID[3];   //获取CPU的ID函数，每个芯片都有唯一的 96_bit unique ID     

/* 程序开始 ----------------------------------------------------------------------*/

/*
 * 函数名：Get_ChipID
 * 描述  ：获取芯片ID
 * 输入  ：无
 * 输出  ：无
 */
void Get_ChipID(void)
{
	ChipUniqueID[0] = *(__IO u32 *)(0X1FFFF7F0); // 高字节
	ChipUniqueID[1] = *(__IO u32 *)(0X1FFFF7EC); // 
	ChipUniqueID[2] = *(__IO u32 *)(0X1FFFF7E8); // 低字节
}

/* END OF FILE ------------------------------------------------------------------*/
