/**
  ******************************************************************************
  * @file     （程序名）      main.h
  * @author （程序作者）      Lu
  * @version（程序版本）      V1.0
  * @date   （修改日期）      2022-2-15
  * @brief  （功能简介）      STM32F103VET6固件库模板
  * @parameter  （参数）	  无
  * @return   （返回值）	  无
  ******************************************************************************
  * @attention （注意事项）
  * 芯片型号 : STM32F103VET6
  * 系统滴答校准固定为9000，当系统滴答时钟设定为9MHz，产生1ms时间基准
  * t = num *(1/clk)
  *	
  ******************************************************************************
  */
/*------------------------------------------------------------------------------*/

#ifndef __SYSTICK_H
#define __SYSTICK_H
/* 用户头文件 ------------------------------------------------------------------*/
#include	<stm32f10x_conf.h>
#include	"main.h"

/* 宏定义 ----------------------------------------------------------------------*/


/* 函数声明 --------------------------------------------------------------------*/
void SysTick_Init(void); //系统滴答时钟初始化函数
void SysTick_Delay_us( uint32_t us );	//延时微秒函数
void SysTick_Delay_ms( uint32_t ms );	//延延时毫秒函数

#endif  /*  __SYSTICK_H */

/* END OF FILE ------------------------------------------------------------------*/


